Repository: aloziq/msaratwasel-services
Catalog: lib/l10n/app_*.arb
Languages: ar

# appTitle
source: Msarat Wasel Services
ar: مسارات واصل للخدمات

# settingsTitle
source: Settings
ar: الإعدادات

# themeTitle
source: Theme
ar: المظهر

source: Dark Mode
ar: الوضع الداكن

# darkModeOn
source: On
ar: مفعل

# darkModeOff
source: Off
ar: معطل

# languageTitle
source: Language
ar: اللغة

# languageName
source: English
ar: العربية

# accountTitle
source: Account
ar: الحساب

source: Logout
ar: تسجيل الخروج

# logoutSubtitle
source: Logout from current account
ar: تسجيل الخروج من الحساب الحالي

# aboutTitle
source: About
ar: عن التطبيق

source: Welcome,
ar: مرحباً،

# greetingMorning
source: Good morning! Have a great day
ar: صباح الخير! يوم موفق لك

# greetingAfternoon
source: Good afternoon! Keep it up
ar: مساء الخير! إستمر بالعطاء

# greetingEvening
source: Good evening! Have a nice day
ar: مساء النور! يوم جميل

source: Quick Actions
ar: إجراءات سريعة

source: My Students
ar: طلابي

source: Scan Attendance
ar: مسح الحضور

source: Attendance History
ar: سجل الحضور

source: Reports
ar: التقارير

source: Coming soon...
ar: قريباً...

source: Student Count
ar: عدد الطلاب

source: Present Today
ar: حاضرون اليوم

source: Absent Today
ar: غائبون اليوم

source: User
ar: المستخدم

source: Home
ar: الرئيسية

source: Profile
ar: الملف الشخصي

source: Settings
ar: الإعدادات

source: Total Students
ar: الطلاب

source: Average Attendance
ar: متوسط الحضور

source: Students List
ar: قائمة الطلاب

# noStudentsFound
source: No students match the search
ar: لا يوجد طلاب يطابقون البحث

# searchPlaceholder
source: Search by name or ID...
ar: البحث باسم الطالب أو الرقم...

source: All
ar: الكل

source: At Home
ar: في المنزل

source: On Bus
ar: في الحافلة

source: At School
ar: في المدرسة

source: Absent
ar: غائب

source: Trip Progress
ar: تقدم الرحلة

# deliveredStudentsCount
source: Delivered {atSchool} of {total} students
ar: تم توصيل {atSchool} من {total} طلاب

source: Remaining
ar: المتبقي

source: Percentage
ar: النسبة

source: Boarded Bus
ar: ركب الحافلة

source: Reached School
ar: وصل المدرسة

source: Arrived Safely
ar: وصل بالسلامة

# guardianLabel
source: Guardian: {name}
ar: ولي الأمر: {name}

# dailyChecklistTitle
source: Daily Tasks List
ar: قائمة المهام اليومية

source: Daily Checklist
ar: القائمة اليومية

source: Bus Tracking
ar: تتبع الحافلة

source: Tasks saved successfully
ar: تم حفظ المهام بنجاح

source: Confirm and Send Report
ar: تأكيد وإرسال التقرير

# checklistTask1
source: Ensure all students have seatbelts fastened
ar: التأكد من ربط أحزمة الأمان لجميع الطلاب

# checklistTask2
source: Review bus cleanliness before and after the trip
ar: مراجعة نظافة الحافلة قبل وبعد الرحلة

# checklistTask3
source: Ensure the bus is completely empty of students
ar: التأكد من خلو الحافلة من الطلاب تماماً

# checklistTask4
source: Check for forgotten student bags
ar: فحص حقائب الطلاب المنسية

# checklistTask5
source: Ensure the air conditioning/ventilation system is working
ar: التأكد من تشغيل نظام التكييف/التهوية

# incidentReportTitle
source: Incident Report
ar: بلاغ عن حادث

source: Incident Type
ar: نوع البلاغ

source: Problem Description
ar: وصف المشكلة

# reportDetailsPlaceholder
source: Write report details here...
ar: اكتب تفاصيل البلاغ هنا...

source: Attach photo (optional)
ar: إرفاق صورة (اختياري)

# reportSentSuccessfully
source: Report sent to management immediately
ar: تم إرسال البلاغ للإدارة فوراً

source: Send Urgent Report
ar: إرسال البلاغ العاجل

# incidentTypeBehavioral
source: Behavioral
ar: سلوكي

# incidentTypeHealth
source: Health
ar: صحي

# incidentTypeTechnical
source: Technical Failure
ar: عطل فني

# incidentTypeTraffic
source: Traffic Accident
ar: حادث مروري

# incidentTypeOther
source: Other
ar: آخر

# reportsTitle
source: Reports & Statistics
ar: التقارير والإحصائيات

# dailyAverageAttendance
source: Daily Avg Attendance
ar: متوسط الحضور اليومي

source: Absence Rate
ar: نسبة الغياب

source: Late Rate
ar: نسبة التأخير

source: Attendance Trend
ar: اتجاه الحضور

# insights
source: Insights & Analytics
ar: رؤى وتحليلات

# insightPerfectAttendance
source: Class {className} has perfect attendance today!
ar: فصل {className} لديه حضور مثالي اليوم!

# insightLowAttendance
source: Attendance dropped by {percentage}% compared to yesterday
ar: انخفاض بنسبة الحضور بنسبة {percentage}% مقارنة بالأمس

source: Attendance Today
ar: حضور اليوم

source: Absence Today
ar: غياب اليوم

source: Weekly Attendance Trend
ar: اتجاه الحضور الأسبوعي

source: Smart Insight
ar: رؤية ذكية

# excellentAttendanceInsight
source: Attendance performance is excellent this week! Keep it up.
ar: أداء الحضور ممتاز هذا الأسبوع! استمر في تحفيز الطلاب.

# lowAttendanceInsight
source: There is a slight drop in attendance. You might want to check the reasons.
ar: هناك انخفاض طفيف في الحضور. قد ترغب في مراجعة الأسباب.

# editProfile
source: Edit personal info
ar: تعديل البيانات الشخصية

source: Change password
ar: تغيير كلمة المرور

source: Change Children Location
ar: تغيير موقع الابناء

# manageKids
source: Manage registered students
ar: إدارة الطلاب المسجلين

# locationChangeWarningTitle
source: Important Notice
ar: تنبيه هام

# locationChangeWarningBody
source: Please note that if the location is changed, the school must be notified 48 hours prior to the change to ensure transport arrangements.
ar: يرجى العلم بأنه في حال تغيير الموقع، يجب إبلاغ المدرسة قبل 48 ساعة من موعد التغيير لضمان ترتيبات النقل.

source: Cancel
ar: إلغاء

source: Proceed
ar: متابعة

source: Appearance
ar: المظهر

# activitiesSubtitle
source: Latest school updates and announcements.
ar: آخر إعلانات وتحديثات المدرسة.

source: Help center
ar: مركز المساعدة

source: Contact us
ar: تواصل معنا

source: About app
ar: عن التطبيق

source: Canteen
ar: المقصف

source: Support
ar: الدعم

# appName
source: Msarat Wasel
ar: مسارات واصل

source: Version
ar: الإصدار

# aboutAppDescription
source: Msarat Wasel is the ideal solution for managing school transport effectively and safely. It allows parents to track their children and receive real-time notifications, ensuring peace of mind and student safety.
ar: تطبيق مسارات واصل هو الحل الأمثل لإدارة النقل المدرسي بفعالية وأمان. يتيح لأولياء الأمور متابعة أبنائهم وتلقي الإشعارات اللحظية، مما يضمن راحة البال وسلامة الطلاب.

# aboutCompanyTitle
source: About Wasel Company
ar: عن شركة واصل

# aboutCompany
source: Wasel School Transport is a leading company in transport services, striving to provide a safe and comfortable transport experience for students while employing the latest technologies to ensure quality and reliability.
ar: شركة واصل للنقل المدرسي هي شركة رائدة في مجال خدمات النقل، تسعى لتقديم تجربة نقل آمنة ومريحة للطلاب مع توظيف أحدث التقنيات لضمان الجودة والموثوقية.

source: Developed by
ar: تم التطوير بواسطة

source: Contact Methods
ar: طرق التواصل

source: Phone Number
ar: رقم الجوال

source: Email
ar: البريد الإلكتروني

source: Website
ar: الموقع الإلكتروني

source: Social Media
ar: حسابات التواصل

# complaintsBox
source: Complaints & Suggestions Box
ar: صندوق الشكاوى والمقترحات

# complaintMessageHint
source: Write your suggestion or complaint here...
ar: اكتب نص الاقتراح أو الشكوى هنا...

source: Submit
ar: إرسال

# complaintSent
source: Your message has been sent successfully
ar: تم إرسال رسالتك بنجاح

source: Current password
ar: كلمة المرور الحالية

# fieldRequired
source: Required
ar: مطلوب

source: New password
ar: كلمة المرور الجديدة

# passwordLengthError
source: Must be at least 6 characters
ar: يجب أن لا تقل عن 6 خانات

# confirmPassword
source: Confirm new password
ar: تأكيد كلمة المرور الجديدة

# passwordMismatch
source: Passwords do not match
ar: كلمات المرور غير متطابقة

source: Save changes
ar: حفظ التغييرات

# passwordUpdatedSuccess
source: Password updated successfully
ar: تم تغيير كلمة المرور بنجاح

source: Privacy Policy
ar: السياسة والخصوصية

# privacyIntroTitle
source: First: Introduction
ar: أولًا: المقدمة

# privacyIntroBody1
source: This document represents a legal agreement between the application users (Guardian, Student, Driver, Supervisor, Teacher, Field Supervisor, School) and the application administration.
ar: هذه الوثيقة تمثل اتفاقًا قانونيًا بين مستخدمي التطبيق (ولي الأمر، الطالب، السائق، المشرفة، المعلم، المشرف الميداني، المدرسة) وبين إدارة التطبيق.

# privacyIntroBody2
source: By using the application, all users acknowledge their agreement to this policy and commitment to it.
ar: باستخدام التطبيق، يقر جميع المستخدمين بموافقتهم على هذه السياسة والالتزام بها.

# privacyDataCollectionTitle
source: Second: Data Collection
ar: ثانيًا: جمع البيانات

# privacyStudentDataTitle
source: Student Data:
ar: بيانات الطالب:

# privacyStudentData1
source: Full Name
ar: الاسم الكامل

# privacyStudentData2
source: School ID
ar: الرقم المدرسي

# privacyStudentData3
source: Civil ID
ar: الرقم المدني

# privacyStudentData4
source: Student Photo
ar: صورة الطالب

# privacyStudentData5
source: Home Photo
ar: صورة المنزل

# privacyStudentData6
source: Bus Geographic Location
ar: الموقع الجغرافي للحافلة

# privacyStudentData7
source: Attendance Log via Barcode
ar: سجل الحضور والانصراف عبر الباركود

# privacyOtherDataTitle
source: Other Data:
ar: بيانات أخرى:

# privacyOtherData1
source: Guardian Data: Name, Phone Number, Email, Civil ID.
ar: بيانات ولي الأمر: الاسم، رقم الهاتف، البريد الإلكتروني، رقم الهوية المدنية.

# privacyOtherData2
source: Driver, Supervisor, and Teacher Data: Name, ID/Job Number, Contact Info.
ar: بيانات السائق والمشرفين والمعلمين: الاسم، رقم الهوية/الوظيفة، بيانات الاتصال.

# privacyOtherData3
source: Technical Data: Login Log, Barcode Usage, Bus Geographic Location.
ar: بيانات تقنية: سجل الدخول، استخدام الباركود، الموقع الجغرافي للحافلة.

# privacyDataUsageTitle
source: Third: Data Usage
ar: ثالثًا: استخدام البيانات

# privacyDataUsage1
source: Ensuring student safety during school transport.
ar: ضمان سلامة الطالب أثناء النقل المدرسي.

# privacyDataUsage2
source: Enabling guardians to track student status.
ar: تمكين ولي الأمر من متابعة حالة الطالب.

# privacyDataUsage3
source: Managing school transport operations efficiently.
ar: إدارة عمليات النقل المدرسي بكفاءة.

# privacyDataUsage4
source: Issuing reports for the school and supervisors.
ar: إصدار تقارير للمدرسة والمشرفين.

# privacyDataUsage5
source: Data is not used for any commercial or promotional purposes.
ar: لا تُستخدم البيانات لأي أغراض تجارية أو دعائية.

# privacyDataProtectionTitle
source: Fourth: Data Protection
ar: رابعًا: حماية البيانات

# privacyDataProtection1
source: Storing data in secure servers using encryption technologies.
ar: تخزين البيانات في خوادم آمنة باستخدام تقنيات التشفير.

# privacyDataProtection2
source: Restricting access to data according to user permissions.
ar: تقييد الوصول للبيانات حسب صلاحيات المستخدم.

# privacyDataProtection3
source: Periodic review of security procedures.
ar: مراجعة دورية لإجراءات الأمان.

# privacyDataProtection4
source: Not sharing data with third parties unless approved by the school or required by law.
ar: عدم مشاركة البيانات مع أطراف ثالثة إلا بموافقة المدرسة أو وفق القانون.

# privacyUserRightsTitle
source: Fifth: User Rights
ar: خامسًا: حقوق المستخدمين

# privacyUserRights1
source: The right to access their data.
ar: الحق في الاطلاع على بياناتهم.

# privacyUserRights2
source: The right to request correction or deletion of inaccurate data.
ar: الحق في طلب تصحيح أو حذف بيانات غير دقيقة.

# privacyUserRights3
source: The right to object to the use of their data for non-educational purposes.
ar: الحق في الاعتراض على استخدام بياناتهم لأغراض غير تعليمية.

# privacyUserObligationsTitle
source: Sixth: User Obligations
ar: سادسًا: التزامات المستخدمين

# privacyUserObligations1
source: Using the application only for educational and school transport purposes.
ar: استخدام التطبيق فقط للأغراض التعليمية والنقل المدرسي.

# privacyUserObligations2
source: Not sharing login credentials with other parties.
ar: عدم مشاركة بيانات الدخول مع أطراف أخرى.

# privacyUserObligations3
source: Adhering to local laws regarding data protection.
ar: الالتزام بالقوانين المحلية المتعلقة بحماية البيانات.

# privacyLegalLiabilityTitle
source: Seventh: Legal Liability
ar: سابعًا: المسؤولية القانونية

# privacyLegalLiability1
source: The application is not responsible for any unauthorized use by users.
ar: التطبيق غير مسؤول عن أي استخدام غير مصرح به من قبل المستخدمين.

# privacyLegalLiability2
source: The school bears the responsibility of managing user permissions.
ar: المدرسة تتحمل مسؤولية إدارة صلاحيات المستخدمين.

# privacyLegalLiability3
source: Any security breach will be dealt with according to local laws (including Royal Decree No. 6/2022 on Personal Data Protection in Oman).
ar: أي خرق أمني سيتم التعامل معه وفق القوانين المحلية (بما في ذلك المرسوم السلطاني رقم 6/2022 بشأن حماية البيانات الشخصية في سلطنة عمان).

# privacyAmendmentsTitle
source: Eighth: Amendments
ar: ثامنًا: التعديلات

# privacyAmendments1
source: The application administration reserves the right to amend this policy in accordance with laws and technical developments.
ar: تحتفظ إدارة التطبيق بحق تعديل هذه السياسة بما يتوافق مع القوانين والتطورات التقنية.

# privacyAmendments2
source: Users will be notified of any substantial changes.
ar: سيتم إخطار المستخدمين بأي تغييرات جوهرية.

# privacyConsentTitle
source: Ninth: Consent
ar: تاسعًا: الموافقة

# privacyConsentBody
source: By using the application, all users agree to this policy and adhere to it.
ar: باستخدام التطبيق، يوافق جميع المستخدمين على هذه السياسة ويلتزمون بها.

# privacySimplifiedTitle
source: ðŸ“± Simplified Version for Users
ar: 📱 نسخة مبسطة للمستخدمين

# privacyQ1
source: Why do we collect data?
ar: لماذا نجمع البيانات؟

# privacyA1
source: - To ensure student safety during the trip. - To help the guardian track the student's arrival and departure. - To facilitate the work of the driver, supervisor, teacher, and field supervisor.
ar: - لضمان سلامة الطالب أثناء الرحلة. - لمساعدة ولي الأمر على متابعة وصول وخروج الطالب. - لتسهيل عمل السائق والمشرفة والمعلم والمشرف الميداني.

# privacyQ2
source: What data do we use?
ar: ما هي البيانات التي نستخدمها؟

# privacyA2
source: - Student name and school number. - Civil ID and student photo for identity verification. - Home photo and bus geographic location. - Student attendance log via barcode. - Guardian data for communication. - Driver, supervisor, and teacher data.
ar: - اسم الطالب ورقمه المدرسي. - الرقم المدني وصورة الطالب للتأكد من الهوية. - صورة المنزل والموقع الجغرافي للحافلة. - سجل حضور وانصراف الطالب عبر الباركود. - بيانات ولي الأمر للتواصل. - بيانات السائق والمشرفين والمعلمين.

# privacyQ3
source: How do we protect your data?
ar: كيف نحمي بياناتك؟

# privacyA3
source: - We store information in secure and encrypted systems. - We do not share your data with any external party unless approved by the school or required by law. - We define access permissions so each user only sees what they need for their work.
ar: - نخزن المعلومات في أنظمة آمنة ومشفرة. - لا نشارك بياناتك مع أي طرف خارجي إلا بموافقة المدرسة أو إذا طلب القانون ذلك. - نحدد صلاحيات الدخول بحيث يرى كل مستخدم فقط ما يحتاجه لعمله.

# privacyQ4
source: Your Rights
ar: حقوقك

# privacyA4
source: - You can access your data. - You can request correction or deletion of incorrect data. - Your data will not be used for any commercial or promotional purposes.
ar: - يمكنك الاطلاع على بياناتك. - يمكنك طلب تعديل أو حذف بيانات غير صحيحة. - بياناتك لن تُستخدم لأي أغراض تجارية أو دعائية.

# privacyQ5
source: Your Obligations
ar: التزاماتك

# privacyA5
source: - Use the application only for school transport. - Do not share your account or login details with others. - Adhere to local laws regarding data protection.
ar: - استخدام التطبيق للنقل المدرسي فقط. - عدم مشاركة حسابك أو بيانات الدخول مع آخرين. - الالتزام بالقوانين المحلية بخصوص حماية البيانات.

source: Application
ar: التطبيق

source: Light
ar: فاتح

source: Dark
ar: داكن

source: Notifications
ar: الإشعارات

source: Chats
ar: المحادثات
